Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Such a suppression list has to be carefully prepared and revisited from time to time. You should consider making individual suppressions time limited by adding an `until` tribute, for example: `<suppress until="2022-01-01Z">...</suppress>`. It will let you doublecheck that only the same known false positives are reported when the suppression period expires, and after reviewing the report you can set a new expiry date.
ja_jp: このような抑制リストは注意深く作成し、時々見直さなければなりません。例えば、 `<suppress until="2022-01-01Z">…​</suppress>` のように、 `until` 属性を追加して、個々の抑制を期間限定にすることを検討すべきです。これによって、抑制期間が終了したときに、同じ既知の偽陽性だけが報告されていることをダブルチェックすることができ、報告書を見直した後に、新しい有効期限を設定することができます。

source: Suffix
ja_jp: 接尾辞

source: Suggest likely causes
ja_jp: 考えられる原因を提案する

source: Summaries and Timers
ja_jp: サマリーとタイマー

source: Summary
ja_jp: 概要

source: Super Hero UI
ja_jp: スーパーヒーローUI

source: Super Heroes User Interface
ja_jp: スーパーヒーローのユーザーインターフェース

source: Superfluous matching conditions are ignored. The conditions sorted by priority in descending order are: `matchRegex()`, `matchNames()` and `matchName()`.
ja_jp: 余分な一致条件は無視されます。優先順位の高い順に並べると、以下のようになります。 `matchRegex()` , `matchNames()` および `matchName()` 。

source: Supersonic Subatomic Java:: our tagline
ja_jp: Supersonic Subatomic Java:: 私達のキャッチフレーズ

source: Supersonic subatomic performance
ja_jp: Supersonic subatomic パフォーマンス

source: Supertype
ja_jp: スーパータイプ

source: Supplementary localized file
ja_jp: ローカライズされた補足ファイル

source: Support
ja_jp: サポート

source: Support 100-Continue in vert.x
ja_jp: Vert.xにおける 100-continue のサポート

source: Support AWT image resize via new AWT extension
ja_jp: 新しいAWTエクステンションによるAWTイメージリサイズのサポート

source: Support When You Need It
ja_jp: 必要なときに必要なサポートを

source: Support all origins in dev mode
ja_jp: 開発モードですべてのオリジンをサポート

source: Support all origins in devmode
ja_jp: devmodeですべてのオリジンをサポート

source: Support and limitations
ja_jp: サポートと制限

source: Support continuous testing for multi module projects
ja_jp: マルチモジュールプロジェクトの継続的テストをサポート

source: Support embedding the H2 DB engine in native executables
ja_jp: ネイティブ実行可能ファイルへのH2 DBエンジンの組み込みに対応

source: Support for @TemplateExtension Methods
ja_jp: TemplateExtension メソッドのサポート

source: Support for Back channel logout
ja_jp: バックチャンネルログアウトに対応

source: Support for Confluent Schema Registry
ja_jp: Confluent Schema Registryのサポート

source: Support for Directly Injecting Beans into Qute Templates
ja_jp: QuteテンプレートへのBeanの直接注入のサポート

source: Support for Hibernate Interceptors
ja_jp: Hibernateインターセプターのサポート

source: Support for Hibernate ORM interceptors
ja_jp: Hibernate ORM インターセプターのサポート

source: Support for JPA entity listeners for Hibernate ORM in native mode
ja_jp: ネイティブモードにおけるHibernate ORMのJPAエンティティリスナーのサポート

source: Support for JVM
ja_jp: JVMのサポート

source: Support for JVM Serverless
ja_jp: JVMサーバーレスのサポート

source: Support for Kotlin is present (assuming you use the Quarkus extension for Kotlin), so you can guard your `suspend` functions with fault tolerance annotations.
ja_jp: Kotlinのサポートがあるため（Kotlin用のQuarkusエクステンションを使用することが前提）、フォールトトレランスのアノテーションで `suspend` 関数を保護することができます。

source: Support for Kotlin serialization has been added to RESTEasy Reactive.
ja_jp: RESTEasy ReactiveにKotlinシリアライゼーションのサポートが追加されました。

source: Support for Maven 3.9
ja_jp: Maven 3.9サポート

source: Support for Mutiny is present, so your asynchronous methods can return `Uni` in addition to `CompletionStage`.
ja_jp: Mutinyがサポートされているので、非同期のメソッドは `CompletionStage` だけでなく `Uni` を返すことができます。

source: Support for OIDC Proof Of Key for Code Exchange (PKCE)
ja_jp: OIDC Proof Of Key for Code Exchange (PKCE)のサポート

source: Support for Qute Validation
ja_jp: Qute Validationのサポート

source: Support for `StatementInspector` as `@PersistenceUnitExtension` managed bean.
ja_jp: `StatementInspector` を `@PersistenceUnitExtension` のマネージドBeanとしてサポート。

source: Support for all the Annotations
ja_jp: すべてのアノテーションのサポート

source: Support for caching annotations for Infinispan
ja_jp: Infinispanのアノテーションのキャッシュをサポート

source: Support for caching annotations has been added to the Infinispan Client extension. You can find more about it in the link:/guides/infinispan-client#infinispan-annotations-api[dedicated section of the guide].
ja_jp: Infinispan Client エクステンションにアノテーションのキャッシュのサポートが追加されました。詳しくは、 link:/guides/infinispan-client#infinispan-annotations-api[ガイドの専用セクション] に記載されています。

source: Support for custom DPoP nonce providers may be offered in the future.
ja_jp: カスタムDPoP nonceプロバイダのサポートは将来提供されるかもしれません。

source: Support for integration extensions (Camel)
ja_jp: インテグレーションエクステンション（Camel）のサポート

source: Support for multiple mailers
ja_jp: 複数のメーラーサポート

source: Support for multiple providers
ja_jp: 複数プロバイダーのサポート

source: Support for native
ja_jp: ネイティブサポート

source: Support for native Serverless
ja_jp: ネイティブサーバーレスのサポート

source: Support for native by default, but also some improvements in jvm mode also
ja_jp: デフォルトではネイティブをサポートしていますが、jvmモードでもいくつかの改良が加えられていること

source: Support for other languages, namely Kotlin and Scala
ja_jp: 他の言語、すなわちKotlinとScalaのサポート

source: Support for servlets
ja_jp: サーブレットのサポート

source: Support for the MicroProfile Metrics API
ja_jp: MicroProfile Metrics API のサポート

source: Support for {project-name} tools
ja_jp: {project-name} toolsのサポート

source: Support is provided for JAX-RS Resource Methods
ja_jp: JAX-RSのリソースメソッドへのサポートが提供されます

source: Support is provided for Jakarta REST Resource Methods
ja_jp: Jakarta REST Resource Methodsへのサポートが提供されます

source: Support is provided for REST Client interface methods
ja_jp: RESTクライアントインタフェースメソッドへのサポートが提供されます

source: Support is provided for Reactive messaging methods
ja_jp: Reactiveメッセージングメソッドへのサポートが提供されます

source: Support is provided for `@ConsumeEvent` methods
ja_jp: `@ConsumeEvent` メソッドへのサポートが提供されます

source: Support is provided for scheduler methods
ja_jp: スケジューラーメソッドへのサポートが提供されます

source: Support is provided for server-side and client-side endpoint methods
ja_jp: サーバーサイドおよびクライアントサイドのエンドポイントメソッドのサポートが提供されます

source: Support is provided for the declarative annotation-based API
ja_jp: 宣言型アノテーションベースAPIへのサポートが提供されます

source: Support limitations of JAX-RS application
ja_jp: JAX-RS アプリケーションのサポートの制限

source: Support limitations of Jakarta REST application
ja_jp: Jakarta RESTアプリケーションのサポートの制限

source: Supported Extensions and Discovery Criteria
ja_jp: サポートされているエクステンションと検出基準

source: Supported Features
ja_jp: サポートされている機能

source: Supported Injection Scopes
ja_jp: サポートされている注入スコープ

source: Supported Literals
ja_jp: サポートされているリテラル

source: Supported Logging APIs
ja_jp: サポートされているロギング API

source: Supported Public Key Formats
ja_jp: サポートされている公開鍵形式

source: Supported Spring Data JPA functionalities
ja_jp: サポートされている Spring Data JPA 機能

source: Supported Spring Data REST functionalities
ja_jp: サポートされているSpring Data RESTの機能

source: Supported Spring Security annotations
ja_jp: サポートされているSpring Securityアノテーション

source: Supported Spring Security functionalities
ja_jp: サポートされている Spring Security 機能

source: Supported Spring Web annotation
ja_jp: サポートされているSpring Webアノテーション

source: Supported Spring Web functionalities
ja_jp: サポートされているSpring Webの機能

source: Supported Token Grants
ja_jp: サポートされるトークングラント

source: Supported Versions
ja_jp: サポートされているバージョン

source: Supported authentication mechanism annotations
ja_jp: サポートされる認証メカニズムのアノテーション

source: Supported authentication mechanisms
ja_jp: サポートされている認証メカニズム

source: Supported build strategies
ja_jp: サポートされるビルドストラテジー

source: Supported clients
ja_jp: 対応クライアント

source: Supported databases
ja_jp: サポートされるデータベース

source: Supported features
ja_jp: サポートされている機能

source: Supported forwarding address headers are:
ja_jp: サポートされている転送アドレスヘッダーは以下の通りです。

source: Supported injection scopes
ja_jp: サポートされている注入スコープ

source: Supported keys and algorithms:
ja_jp: サポートされているキーとアルゴリズム:

source: Supported model types
ja_jp: サポートされているモデルの種類

source: Supported public key formats
ja_jp: サポートされている公開鍵形式

source: Supported return types
ja_jp: サポートされている戻り値のタイプ

source: Supported scopes
ja_jp: サポートされているスコープ

source: Supported token grants
ja_jp: サポートされるトークングラント

source: Supporting native compilation in C
ja_jp: C言語でのネイティブコンパイルのサポート

source: Supporting native in a Quarkus extension
ja_jp: Quarkus 拡張機能でネイティブをサポートする

source: Supporting native in a Quarkus extension is even easier as Quarkus provides a lot of tools to simplify all this.
ja_jp: Quarkus のエクステンションでのネイティブのサポートは、Quarkus がこれらすべてを単純化するための多くのツールを提供しているため、さらに簡単になりました。

source: Supporting native in your application
ja_jp: アプリケーションでのネイティブのサポート

source: Supporting secure connections with SSL
ja_jp: SSL によるセキュアな接続のサポート

source: Supporting secure connections with TLS/SSL
ja_jp: TLS/SSLによる安全な接続のサポート

source: Supports
ja_jp: サポート対象

source: Supports Optional End Tag
ja_jp: オプションの終了タグをサポート

source: Supports traceable inputs, audit trails, and governance-ready execution from day one.
ja_jp: トレース可能な入力、監査証跡、および最初からガバナンス対応の実行をサポートします。

source: Suppose we have a CDI bean with two methods, one of which has the `@Transactional` interceptor binding associated with it:
ja_jp: メソッドが 2 つある CDI Bean があり、そのうちの 1 つに `@Transactional` インターセプターバインディングが関連付けられているとします。

source: Suppose you run in a constrained environment, such as containers. In that case, monopolization can quickly become a concern, as the high memory usage can lead to out-of-memory issues and container termination. The memory usage may be higher than with regular worker threads because of the inherent cost of the scheduling and virtual threads.
ja_jp: コンテナーのような制約のある環境で実行するとします。その場合、メモリー使用量の多さがメモリ不足の問題やコンテナーの終了につながる可能性があるため、独占はすぐに懸念事項となります。 メモリー使用量は、スケジューリングと仮想スレッドに固有のコストがかかるため、通常のワーカースレッドよりも高くなる可能性があります。

source: Suppose you use libraries that depend on other logging libraries, such as Apache Commons Logging, Log4j, or SLF4J. In that case, exclude them from the dependencies and use one of the JBoss Logging adapters.
ja_jp: Apache Commons Logging、Log4j、SLF4J など、他のロギングライブラリに依存するライブラリを使用する場合。 その場合、依存関係からそれらを除外し、JBoss Logging アダプターのいずれかを使用します。

source: Sure, if your application ends up needing a `SecureRandom` anyway, you don't care. But if it doesn't, having your favorite framework generate ``UUID``s for internal use is not ideal.
ja_jp: もちろん、アプリケーションがいずれにせよ `SecureRandom` を必要とするのであれば気にすることはありません。しかし、必要ない場合に、お気に入りのフレームワークが内部用途のために ``UUID`` を生成するのは理想的ではありません。

source: Swagger API w/ Developer UI
ja_jp: Developer UI付のSwagger API

source: Swagger UI configuration and custom styling
ja_jp: Swagger UIの設定とカスタムスタイリング

source: Swagger UI is included by default when running in `Dev` or `Test` mode, and can optionally added to `Prod` mode. See xref:openapi-swaggerui.adoc#use-swagger-ui-for-development[the Swagger UI] Guide for more details.
ja_jp: Swagger UIは、 `Dev` または `Test` モードで実行するとデフォルトで含まれ、オプションで `Prod` モードに追加できます。 詳細は xref:openapi-swaggerui.adoc#use-swagger-ui-for-development[Swagger UI] ガイドを参照してください。

source: Swagger UI is included by default when running in `Dev` or `Test` mode, and can optionally be added to `Prod` mode. See xref:openapi-swaggerui.adoc#dev-mode[the Swagger UI] Guide for more details.
ja_jp: Swagger UIは、 `Dev` または `Test` モードで実行するとデフォルトで含まれており、オプションで `Prod` モードに追加することができます。詳細は xref:openapi-swaggerui.adoc#dev-mode[Swagger UI] ガイドをご覧ください。

source: Swagger UI is included by default when running in `dev` or `test` mode, and can optionally added to `prod` mode. See <<openapi-swaggerui.adoc#dev-mode,the Swagger UI>> Guide for more details.
ja_jp: Swagger UIは、 `dev` または `test` モードで実行しているときにデフォルトで含まれており、オプションで `prod` モードに追加することができます。詳細については、<<openapi-swaggerui.adoc#dev-mode,the Swagger UI>> ガイドを参照してください。

source: Swagger UI is included by default when running in `dev` or `test` mode, and can optionally be added to `prod` mode. For more information, see the <<openapi-swaggerui.adoc#dev-mode,Swagger UI>> guide.
ja_jp: Swagger UIは、 `dev` または `test` モードで実行するとデフォルトで含まれ、オプションで `prod` モードに追加できます。 詳細については、 xref:openapi-swaggerui.adoc#dev-mode[Swagger UI] ガイドを参照してください。

source: Swagger UI is included by default when running in `dev` or `test` mode, and can optionally be added to `prod` mode. For more information, see the xref:openapi-swaggerui.adoc#dev-mode[Swagger UI] guide.
ja_jp: Swagger UIは、 `dev` または `test` モードで実行するとデフォルトで含まれ、オプションで `prod` モードに追加することができます。詳細については、 xref:openapi-swaggerui.adoc#dev-mode[Swagger UI] ガイドを参照してください。

source: Swagger UI is included by default when running in `dev` or `test` mode, and can optionally be added to `prod` mode. See <<openapi-swaggerui.adoc#dev-mode,the Swagger UI>> Guide for more details.
ja_jp: Swagger UIは、 `dev` や `test` モードで実行しているときにデフォルトで含まれており、 `prod` モードに追加することもできます。詳細については、<<openapi-swaggerui.adoc#dev-mode,開発にSwagger UIを使用する>> を参照してください。

source: Swagger/GraphQL/Health/OpenAPI UIs
ja_jp: Swagger/GraphQL/Health/OpenAPI UI

source: Swagger/GraphQL/Health/OpenAPI UIs and Swagger UI configuration
ja_jp: Swagger/GraphQL/Health/OpenAPI UIとSwagger UIの設定

source: Switch back to a `Uni<Void>`.
ja_jp: `Uni<Void>` に戻ります。

source: Switch the incoming channel `orders` (expecting messages from Kafka) to in-memory.
ja_jp: (Kafka からのメッセージが想定される) 着信チャネル `orders` をインメモリーに切り替えます。

source: Switch the incoming channel `words-in` (consumed messages) to in-memory.
ja_jp: 着信チャネルl `words-in` (消費されたメッセージ) をin-memory に切り替えます。

source: Switch the outgoing channel `beverages` (writing messages to Kafka) to in-memory.
ja_jp: (Kafka へのメッセージを書き込む) 送信チャネル `beverages` をインメモリーに切り替えます。

source: Switch the outgoing channel `uppercase` (processed messages) to in-memory.
ja_jp: 発信チャネル `uppercase` (処理済みメッセージ) を in-memory に切り替えます。

source: Switch the outgoing channel `words-out` (produced messages) to in-memory.
ja_jp: 発信チャネル `words-out` (生成されたメッセージ) を in-memory に切り替えます。

source: Switch the working directory to `/work`, which we have mounted in <1>.
ja_jp: 作業ディレクトリーを、<1> でマウントした `/work` に切り替えます。

source: Switch to a worker thread by annotating the `hello` endpoint with `@Blocking`.
ja_jp: `hello` エンドポイントに `@Blocking` アノテーションを付けて、ワーカースレッドに切り替えます。

source: Switch to the link:https://github.com/quarkusio/quarkusio.github.io/tree/develop/_redirects/guides[`quarkusio/quarkusio.github.io`] repository, and open the `_redirects/guides` folder.
ja_jp: link:https://github.com/quarkusio/quarkusio.github.io/tree/develop/_redirects/guides[`quarkusio/quarkusio.github.io`] リポジトリーに切り替えて、 `_redirects/guides` フォルダーを開きます。

source: Switching to the required {openshift} project
ja_jp: 必要な {openshift} プロジェクトへの切替

source: Synchronous code on virtual thread
ja_jp: 同期コードで仮想スレッド上

source: Synchronous code on worker thread
ja_jp: 同期コードでワーカースレッド上

source: Syncing plugins
ja_jp: プラグインの同期

source: Synthetic Beans
ja_jp: 合成 Bean

source: Synthetic Injection Point - Build Step Example
ja_jp: 合成注入ポイント - ビルドステップの例

source: Synthetic Injection Point - Recorder Example
ja_jp: 合成注入ポイント - レコーダーの例

source: Synthetic Injection Points
ja_jp: 合成注入ポイント

source: Synthetic beans
ja_jp: 合成Bean

source: Synthetic beans are usually provided by extensions. Therefore, we are not going to cover them in this guide.
ja_jp: 合成Beanは通常、エクステンションによって提供されます。そのため、このガイドではそれらを取り上げません。

source: Synthetic beans initialized during `RUNTIME_INIT` must not be accessed during `STATIC_INIT`. `RUNTIME_INIT` build steps that access a runtime-init synthetic bean should consume the `SyntheticBeansRuntimeInitBuildItem`:
ja_jp: `RUNTIME_INIT` の間に初期化された合成 Bean は、 `STATIC_INIT` の間にアクセスしてはいけません。runtime-init 合成 Bean にアクセスする `RUNTIME_INIT` ビルドステップは、 `SyntheticBeansRuntimeInitBuildItem` を消費します。

source: Syslog log handler
ja_jp: Syslog ログハンドラー

source: System Properties
ja_jp: システムプロパティ

source: System environment (for example `QUARKUS_PACAKGE_TYPE=fast-jar ./gradlew ...`)
ja_jp: システム環境（例： `QUARKUS_PACAKGE_TYPE=fast-jar ./gradlew …​` ）

source: System environment (for example `QUARKUS_PACKAGE_JAR_TYPE=fast-jar ./gradlew ...`)
ja_jp: システム環境 (例: `QUARKUS_PACKAGE_JAR_TYPE=fast-jar ./gradlew ...`)

source: System environment (for example `QUARKUS_PACKAGE_TYPE=fast-jar ./gradlew ...`)
ja_jp: システム環境 (例: `QUARKUS_PACKAGE_TYPE=fast-jar ./gradlew …​` )

source: System properties
ja_jp: システムプロパティー

source: System properties (for example `./gradlew -Dquarkus.package.jar.type=fast-jar ...`)
ja_jp: システムプロパティー (例: `./gradlew -Dquarkus.package.jar.type=fast-jar ...`)

source: System properties (for example `./gradlew -Dquarkus.package.type=fast-jar ...`)
ja_jp: システムプロパティ（例： `./gradlew -Dquarkus.package.type=fast-jar …​` ）

source: System properties can be handed to the application through the `-D` flag during startup. The following examples assign the value `youshallnotpass` to the attribute `quarkus.datasource.password`.
ja_jp: システムプロパティーは、起動時に `-D` フラグを介してアプリケーションに渡すことができます。次の例では、値 `youshallnotpass` を属性 `quarkus.datasource.password` に割り当てます。

source: System vs. Container
ja_jp: システムvsコンテナ

source: T -> https://github.com/grafana/tempo[Tempo] (traces)
ja_jp: T -> https://github.com/grafana/tempo[Tempo] (トレース)

source: TL;DR
ja_jp: 詳細な説明

source: TLS 1.3 completely removes support for renegotiation, effectively closing this potential attack vector.
ja_jp: TLS 1.3 では再ネゴシエーションのサポートが完全に削除され、この潜在的な攻撃ベクトルが事実上閉じられます。

source: TLS Configuration
ja_jp: TLS 設定

source: TLS KeyStore type configuration.
ja_jp: TLS KeyStoreタイプの設定。

source: TLS Registry also provides automatic certificate reloading , integration with Let's Encrypt (ACME) , support for Kubernetes Cert-Manager, and compatibility with various keystore formats, such as PKCS12, PEM, and JKS.
ja_jp: TLS レジストリーは、証明書の自動再読み込み、 Let's Encrypt (ACME) との統合、 Kubernetes Cert-Manager のサポート、 および PKCS12、PEM、JKS などのさまざまなキーストアフォーマットとの互換性も提供します。

source: TLS Registry name
ja_jp: TLS レジストリー名

source: TLS TrustStore type configuration. You need to set this configuration when client authentication is required.
ja_jp: TLS TrustStoreタイプの設定。クライアント認証が必要な場合は、この設定を行う必要があります。

source: TLS configuration
ja_jp: TLSの設定

source: TLS configuration primarily involves managing keystores and truststores. The specific setup depends on the format used, such as PEM, P12, or JKS.
ja_jp: TLS 設定には、主にキーストアとトラストストアの管理が含まれます。 具体的な設定は、使用されるフォーマット (PEM、P12、JKS など) により異なります。

source: TLS properties
ja_jp: TLS プロパティー

source: TLS protocol versions
ja_jp: TLS プロトコルのバージョン

source: TLS registry configuration and usage
ja_jp: TLSレジストリの設定と使用

source: TLS registry configuration for Quarkus OIDC be able to communicate with the OIDC provider over MTLS
ja_jp: Quarkus OIDC の TLS レジストリー設定により、MTLS 経由で OIDC プロバイダーと通信できるようになります。

source: TLS registry configuration requiring external clients to authenticate to the Quarkus endpoint over MTLS
ja_jp: 外部クライアントが MTLS 経由での Quarkus エンドポイントの認証を必須にする TLS レジストリー設定

source: TLS registry reference
ja_jp: TLS レジストリーリファレンス

source: TLS with Mutual Auth
ja_jp: 相互認証付きTLS

source: TNS Alias Format
ja_jp: TNS エイリアス形式

source: TNS alias format
ja_jp: TNSエイリアス形式

source: Table Additional response body parameter type
ja_jp: 表 追加のレスポンスボディパラメーター型

source: Table Context object
ja_jp: Table Contect オブジェクト

source: Table Exception mapper parameters
ja_jp: テーブル例外マッパーパラメーター

source: Table Exception mapper return types
ja_jp: テーブル 例外マッパーの戻り値の型

source: Table Filter parameters
ja_jp: テーブルフィルターパラメーター

source: Table Filter return types
ja_jp: テーブルフィルターの戻り値の型

source: Table HTTP method annotations
ja_jp: テーブル HTTP メソッドのアノテーション

source: Table HTTP request parameter annotations
ja_jp: テーブル HTTP リクエストパラメーターアノテーション

source: Table Request body parameter type
ja_jp: テーブルリクエスト本文のパラメータータイプ

source: Table data
ja_jp: テーブルデータ

source: Table name. Do not define it as `user`, which is a restricted keyword in most databases.
ja_jp: テーブル名。ほとんどのデータベースで制限されているキーワードである `user` としては定義しないでください。

source: Tag Call Site
ja_jp: タグ呼び出しサイト

source: Tag Examples
ja_jp: タグの例

source: Tag `myTag`
ja_jp: タグ `myTag`

source: Tag content injected using the `nested-content` key in the tag template.
ja_jp: タグテンプレートで `nested-content` キーを使用して注入されたタグコンテンツ。

source: Tag the image using your ECR registry information
ja_jp: ECR の登録情報を使用したイメージへのタグ付け

source: Tag your content to improve findability by adding at least one category to the categories attribute line in the <<document-header,document header>>. To add multiple categories, use comma-separated values. For example:
ja_jp: <<document-header,document header>> のcategories 属性行に少なくとも 1 つのカテゴリーを追加して、タグ付けを行い、見つけやすくします。複数のカテゴリーを追加するには、コンマで区切られた値を使用します。たとえば、以下のようになります:

source: Tag your content to improve findability by adding at least one category to the categories attribute line in the xref:document-header[document header]. To add multiple categories, use comma-separated values. For example:
ja_jp: link:#Document header[ドキュメントヘッダー] のcategories属性行に少なくとも1つのカテゴリーを追加することで、コンテンツの見つけやすさを向上させるためのタグ付けを行います。複数のカテゴリーを追加するには、カンマで区切られた値を使用します。例えば、以下のようになります:

source: Tags
ja_jp: タグ

source: Tags can be specified when a meter is registered with a `MeterRegistry` or using a <<meter-filter,Meter Filter>>.
ja_jp: タグは、メーターが `MeterRegistry` に登録されるとき、または<<meter-filter,Meter Filter>> を使用して指定できます。

source: Take Away
ja_jp: まとめ

source: Take Requests - Open ended
ja_jp: テイクリクエスト - オープンエンド

source: Take a look at the https://avro.apache.org/docs/current/spec.html#schemas[Avro specification] to learn more about the Avro syntax and supported types.
ja_jp: Avro 構文とサポートされているタイプの詳細については、 https://avro.apache.org/docs/current/spec.html#schemas[Avro 仕様] を参照してください。

source: Take a look at the https://www.youtube.com/watch?v=l3mLKU3wR2A[70th episode of Quarkus Insights] for a more detailed explanation and examples.
ja_jp: より詳細な説明や事例については、 link:https://www.youtube.com/watch?v=l3mLKU3wR2A[Quarkus Insightsの第70回目のエピソード]をご覧ください。

source: Take a look at {quickstarts-tree-url}/optaplanner-quickstart[the quickstart source code] to see how this all turns out.
ja_jp: {quickstarts-tree-url}/optaplanner-quickstart[クイックスタートソースコード] で、どのように表示されるか確認します。

source: Take a look at: xref:observability-devservices-lgtm.adoc[Getting Started with Grafana-OTel-LGTM].
ja_jp: xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM のスタートガイド] を参照してください。

source: Take a note of the process id (i.e. 2434426) since we will need to kill the process later.
ja_jp: 後でプロセスをkillする必要があるので、プロセスID（例：2434426）をメモしておきます。

source: Take care with whitespace when working with document-scoped attributes. The document header ends with the first blank line.
ja_jp: ドキュメントスコープの属性を扱うときは、空白に注意してください。ドキュメントヘッダーは、最初の空白行で終了します。

source: Take the code from the following listing and place into `security-jwt-quickstart/src/main/java/org/acme/security/jwt/GenerateToken.java`:
ja_jp: 次に示したコードを、 `security-jwt-quickstart/src/main/java/org/acme/security/jwt/GenerateToken.java` に記述してください:

source: Take the code from the following listing and place into `security-jwt-quickstart/src/test/java/org/acme/security/jwt/GenerateToken.java`:
ja_jp: 次のリストからコードを取得し、 `security-jwt-quickstart/src/test/java/org/acme/security/jwt/GenerateToken.java` に配置します。

source: Take the code from the following listing and place it into `security-jwt-quickstart/src/test/java/org/acme/security/jwt/GenerateToken.java`:
ja_jp: 次のリストからコードを取得し、 `security-jwt-quickstart/src/test/java/org/acme/security/jwt/GenerateToken.java` に配置します。

source: Takeovers
ja_jp: 引継ぎ

source: Taking a step back, we actually don't need this JAR in 99% of cases, so we should avoid building it (while still keeping the flexibility to do so when absolutely necessary).
ja_jp: 一歩引いて考えると、実際にはこのJARは99%のケースで必要ありません。したがって、構築を避けるべきです（ただし、絶対に必要な場合はその柔軟性を維持します）。
